unit exithero;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure exit_hero ();

implementation

uses

  crt,
  mmsystem,
  soloway,
  teamway;

procedure exit_hero ();

var

  g: integer;
  FF: file of integer;

begin

  sndplaysound('freedom.wav',snd_async);

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****    Ты наконец-то выбрался из холодных коридоров подземелья наружу. Оглядевшись, ты увидел полуразрушенную      ****');
  writeln('****    крепость. От башен и стен мало что осталось, именно поэтому разбойники прятались в подземельях давно        ****');
  writeln('****    забытого форта. Но нельзя медлить ни секунды, оглядев своё снаряжение ты отправился подальше от этого       ****');
  writeln('****    места, чтобы хорошо обдумать свои дальнейшие действия...                                                    ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');

  readln();

  clrscr();

  assign(FF, 'companion.dat');
    reset(FF);
      read(FF,g);
    close(FF);

  if g = 1 then
  begin

    team_way();

  end

  else
  if g = 2 then
  begin

    solo_way();

  end;

end;

end.

