unit elfinprison;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure elf_in_prison ();

implementation

uses

  crt;

procedure elf_in_prison ();

var

  g: integer;
  FF: file of integer;

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****    Постой, приятель! Не бросай меня здесь, я всего лишь несчастный путник! Выпусти меня отсюда скорее!         ****');
  writeln('****    Будь уверен, я крайне полезен тебе в твоём путешествии! Возможно ты и есть тот, кто мне нужен!              ****');
  writeln('****    Я слышу шаги, поторопись! Как только выберемся я расскажу о себе!                                           ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****        Спасёшь пленного эльфа?                                                                                 ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****        [Чтобы принять решение введите номер выбранного вами варианта]                                          ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****        1. Я спасу пленника! Я думаю, что он поможет мне прояснить некоторые детали!                            ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****        2. Вот ещё! Откуда мне знать кто он такой? Вдруг он ночью ограбит и зарежет меня!                       ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');

  readln(g);

  if g = 1 then
  begin

    assign(FF, 'companion.dat');
      rewrite(FF);
        write(FF,g);
      close(FF);

  end

  else
  if g = 2 then
  begin

    assign(FF, 'companion.dat');
      rewrite(FF);
        write(FF,g);
      close(FF);

  end;

end;

end.

