unit herolore1;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure hero_lore_1 ();

implementation

uses

  crt;

procedure hero_lore_1 ();

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****    Ты родился и вырос очень далеко отсюда, на родине высших эльфов, как ни странно, ты                         ****');
  writeln('****    и в самом деле высший эльф. У тебя от рождения были выдающиеся способности к магии. Когда                   ****');
  writeln('****    ты немного подрос, отец стал обучать тебя простейшим заклинаниям, несмотря на запреты со стороны            ****');
  writeln('****    матери. Она боялась, что использование магии заметят люди, которые издавна недолюбливают высших эльфов.     ****');
  writeln('****    Ты рос и твои навыки улучшались с каждым днём. Ты вырос настоящим воином и немного погодя,                  ****');
  writeln('****    уговорив родителей отпустить тебя, отправился в путешествие по миру.                                        ****');
  writeln('****                                                                                                                ****');
  writeln('****    Ты искал своё истинное предназначение, ты искал своё счастье. Но рано или поздно ты обязан                  ****');
  writeln('****    вернуться домой. Ведь ты обещал матери и отцу, что обязательно увидишь их...                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');

  readln();

end;

end.

