unit herolore3;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure hero_lore_3 ();

implementation

uses

  crt;

procedure hero_lore_3 ();

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****    Мастер меча. Ты родился и вырос далеко отсюда, в тихом селении людей в живописной долине южной              ****');
  writeln('****    провинции. Будучи ребёнком, ты был смелым и решительным, и даже физически был развит не по годам,           ****');
  writeln('****    в отличии от своих сверстников, которые при виде тебя не смели обижать младших ребят. Твой отец мечтал,     ****');
  writeln('****    что ты станешь настоящим воином и тренировал тебя. Когда ты стал совсем взрослым, тебя взяли на почётную    ****');
  writeln('****    службу при дворе правителя, ты стал гвардейцем во дворце. Незадолго до ужасных событий связанных с          ****');
  writeln('****    придворным магом ты взял несколько свободных дней, чтобы повидать родных.                                   ****');
  writeln('****                                                                                                                ****');
  writeln('****    Ты искал своё истинное предназначение, ты искал своё счастье. Но рано или поздно ты обязан                  ****');
  writeln('****    вернуться домой. Ведь ты обещал матери и отцу, что обязательно увидишь их...                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');

  readln();

end;

end.

