unit herolore2;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure hero_lore_2 ();

implementation

uses

  crt;

procedure hero_lore_2 ();

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****    Ты родился и вырос очень далеко отсюда, на родине лесных эльфов, как ни                                     ****');
  writeln('****    странно, ты и в самом деле лесной эльф. У тебя от рождения были выдающиеся способности к                    ****');
  writeln('****    маскировке и острое зрение. Когда ты немного подрос, отец стал обучать тебя стрельбе из лука и              ****');
  writeln('****    охоте в лесу, несмотря на запреты со стороны матери. Она боялась, что твои успехи могут заинтересовать      ****');
  writeln('****    людей, которые издавна недолюбливают лесных эльфов. Ты рос и твои навыки улучшались с каждым днём.          ****');
  writeln('****    Ты вырос настоящим воином и немного погодя, уговорив родителей отпустить тебя, отправился                   ****');
  writeln('****    в путешествие по миру.                                                                                      ****');
  writeln('****                                                                                                                ****');
  writeln('****    Ты искал своё истинное предназначение, ты искал своё счастье. Но рано или поздно ты обязан                  ****');
  writeln('****    вернуться домой. Ведь ты обещал матери и отцу, что обязательно увидишь их...                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');

  readln();

end;

end.

