unit teamway;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure team_way ();

implementation

uses

  crt;

procedure team_way ();

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****    Ты помог выбраться пленнику и теперь вы с ним стояли на лесной тропе обдумывая своё положение               ****');
  writeln('****    и планируя дальнейшие действия...                                                                           ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****        [Чтобы принять решение введите номер выбранного вами варианта]                                          ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****        1. Я отправлюсь поскорее домой! Ведь я так долго ждал встречи с родителями!                             ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****        2. Необходимо вернуться! Меня схватили не просто так, есть некая причина!                               ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****        3. Я отправлюсь прямиком в столицу! У меня нехорошее предчувствие!                                      ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****        4. В ближайшем поселении я распрошу местных жителей о возможных недавних происшествиях!                 ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('****                                                                                                                ****');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');
  writeln('************************************************************************************************************************');

  readln();

end;

end.

